Repository: jsbsan/helptranslator
Catalog: .lang/*.po
Languages: fr, it, pt

source: Sencilla herramienta que ayuda a traducir aplicaciones, usando los ficheros .po
fr: Helptranslator est un outil simple qui permet de traduire les fichiers .po
it: Semplice strumento che aiuta a tradurre le applicazioni, l'utilizzo di file .po
pt: Simples ferramenta que ajuda a traduzir aplicações usando ficheiros .po

source: fichero de traduccion po
fr: fichier de traduction po
it: il file di traduzione po
pt: ficheiro de tradução .po

source: Hay un problema al intentar abrir el archivo .po, parece que no existe
fr: Il y a un problème à l'ouverture du fichier .po, il n'existe pas
it: C'è un problema quando si cerca di aprire il file .po, sembra che ci
pt: Há um problema ao tentar abrir o arquivo .po, parece não existir

source: Lineas:
fr: Lignes :

source: El texto a traducir esta cargado en el portapapeles
fr: Le texte à traduire est chargé dans le presse-papier
it: Il testo da tradurre viene caricato nella clipboard
pt: O texto a traduzir está carregado no porta-papéis

source: Error: No se han traducido todas las lineas, tienes que terminar de traducir todos los lotes
fr: Erreur: Toutes les lignes ne sont pas traduites, vous devez terminer la traduction de tous les lots

source: El textbox con las traducciones esta vacio :(
fr: La zone de texte à traduire est vide :(
it: La casella di testo con la traduzione è vuoto :(
pt: O textbox com as traduções está vazio :(

source: Ha habido un problema con las cadenas de texto que tengo que traducir ¿te has saltado algun paso?
fr: Il y a un problème avec les chaînes à traduire Avez-vous bien suivi toutes les étapes ?
it: C'è stato un problema con le stringhe che devo tradurre avere saltato ogni passo?
pt: Houve um problema com as cadeias de texto que tenho que traduzir ?saltou algum passo?

source: Se han añadido las traducciones. Ahora compruebe la traducción porque Google no es perfecto :) !!!
fr: Les traductions ont été ajoutées. Veuillez vérifier la traduction car Google n'est pas parfait :) !!!
it: Sono state aggiunte le traduzioni. Ora controllare la traduzione, perché Google non è perfetto :) !!!
pt: Foram adicionadas as traduções. Agora comprove a tradução porque o Google não é perfeito:)!!!

source: El proximo inicio del programa, estará traducido al inglés
fr: Au prochain lancement le programme sera traduit en Anglais
it: Il prossimo avvio del programma sarà tradotto in inglese
pt: Da próxima vez que iniciar o programa, estará na versão Inglesa

source: El proximo inicio del programa, estará traducido al español
fr: Au prochain lancement le programme sera traduit en Espagnol
it: Il prossimo avvio del programma sarà tradotto in spagnolo
pt: Da próxima vez que iniciar o programa, estará na versão Espanhola.

source: Se supera el valor maximo del array existente
fr: Valeur maximale du tableau existant

source: intervalor por lote terminado.
fr: estimation de l'interval par lots.

source: Se ha producido un error, al extraer el intervalos de valores del array
fr: Une erreur s’est produite lors du retrait des plages de valeurs dans le tableau

source: El contenido del portapapeles no contiene texto a pegar
fr: Le contenu à coller ne contient pas de texte

source: Datos pegados en el textbox
fr: Données collées dans le champ

source: El proximo inicio del programa, estará traducido al frances
fr: Au prochain lancement le programme sera traduit en Français

source: ir a https://translate.google.com/
fr: Ouvrir https://translate.google.com/
it: vai a https://translate.google.com/

source: Lotes
fr: Lots

source: Tamaño lote:
fr: Nbr de lignes :

source: Paso 5: Pegue el texto en este textbox:
fr: Etape 5: Cliquez sur le bouton coller :
it: Fase 5: Incollare il testo nella casella di testo:
pt: Etapa 5: Cole o texto neste textbox:

source: añadir el contenido del portapapeles
fr: ajouter le contenu du presse-papiers

source: Paso 4: Selecciona y copia en el portapapeles, el texto traducido.
fr: Etape 4: Sélectionnez et copiez dans le presse-papiers, le texte traduit.
it: Passo 4: Selezionare e copiare negli appunti il ​​testo tradotto.
pt: Etapa 4: Seleccione e copie no porta-papéis o texto traduzido.

source: Paso 3: En el portapapeles se ha pegado las cadenas que hay que traducir. Ve a la página de google traduce, elige el idioma de origen y el idioma destino y pega el contenido del portapapeles (en la caja de idioma origen) . Pulsar traducir
fr: Etape 3: Le presse-papier contient les chaînes à traduire. Aller dans la page de Google Translation, choisissez la langue source et la langue cible puis collez le contenu du presse-papier (dans le cadre de la langue d'origine). Appuyer sur traduire
it: Passo 3: In Appunti ha colpito le stringhe da tradurre. Vai alla pagina di google tradurre, scegli la lingua di partenza e la lingua di destinazione e incollare il contenuto degli appunti (nel caso di origine della lingua). Pulsar tradurre
pt: Etapa 3: No porta-papéis foram coladas cadeias que há a traduzir. Vá à página do tradutor google, escolha o idioma de origem e idioma de destino e cole o conteúdo do porta-papéis (na caixa do idioma origem). Pressione traduzir.

source: Extraigo cadenas
fr: Extraction des chaînes
it: Stringhe Estratto
pt: Extraindo cadeias

source: Lineas: 0
fr: Lignes : 0

source: Paso 2: Extraer Cadenas traducibles
fr: Etape 2: Extraire les chaînes à traduire
it: Step 2: Estrarre Catene traducibili
pt: Etapa 2: Extraír Cadeias traduziveis

source: Paso 1: elige el archivo idioma .po
fr: Etape 1: Choisir la langue du fichier .po
it: Passo 1: scegli il file .po lingua
pt: Etapa 1: escolhe o arquivo idioma.po

source: El archivo .po estará en la carpeta oculta .lang
fr: Le fichier .po sera dans le dossier caché .lang
it: Il file .po sarà nella cartella nascosta lang
pt: O arquivo .po estará na pasta oculta .lang

source: Paso 0: crear el archivo .po. En gambas se va al menu Proyecto / Traducir se elige un idioma y se traduce una frase para que se cree el archivo .po del idioma elegido.
fr: Etape 0: Créer le fichier .po. Pour cela dans Gambas, aller au menu Projet/Traduire choisir une langue et traduire une phrase ou un mot. Le fichier po pour la langue choisie sera créé.
it: Fase 0: creare il file .po. In gamberi si va al menu Progetto / Tradurre una lingua viene scelta e una frase è tradotta .po file viene creato la lingua scelta.
pt: Etapa 0: criar o arquivo .po. Em gambas vá a menu Projecto / Traduzir escolha o idioma e traduza uma frase para que se crie o arquivo .po do idioma escolhido.

source: Autor: Julio Sánchez Berro Licencia GPL 2.0
fr: Auteur : Julio Sanchez Berro GPL 2.0 Licence
it: Autore: Julio Sanchez Berro GPL License 2.0

source: Herramienta para ayudar a traducir aplicaciones con fichero *.po
fr: Outil d'aide à la traduction des fichiers *.po
it: Strumento per aiutare a tradurre * applicazioni di file .po
pt: Ferramenta para ajudar a traduzir aplicações com ficheiros .po

source: borrar el contenido
fr: supprimer le contenu

source: Paso 6: Pulsa el botón :
fr: Etape 6: Cliquez sur ajouter :
it: Punto 6: Premete il tasto:
pt: Etapa 6: Pressione o botão:

source: Borrar frases que estuvieran traducidas
fr: Les phrases ont été traduites
it: Cancella le frasi che sono state tradotte
pt: Apagar frases que estão traduzidas

source: Paso 7: Al fichero .po se le ha añadido la traducción.
fr: Etape 7: Le fichier de traduction .po a été ajouté à votre projet.
it: Passo 7: Quando .po file è stato aggiunto traduzione.
pt: Etapa 7: Ao ficheiro .po foi adicionada a tradução.

source: Añadir traducción
fr: Ajouter toute la traduction
it: Aggiungi traduzione
pt: Adicionar tradução

source: Visite mi blog: jsbsan.blogspot.com
fr: Visitez mon blog: jsbsan.blogspot.com
it: Visita il mio blog: jsbsan.blogspot.com
pt: Visite o meu blog: jsban.blogspot.com

source: Version
it: Versione
pt: Versão
